Бухгалтерские_задачи_Финиш/src/Documents/ВыплатыДенежныхСредств/ВыплатыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатыДенежныхСредств</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Наличные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>ДДС</name>
    <type>
      <types>CatalogRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_Финиш/src/Documents/ВыплатыДенежныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОрганизацияПриИзмененииНаСервере();
	КорСчетПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	УстановитьПараметрыФункциональныхОпцийФормы(
	Новый Структура("ПФО_Организация", Объект.Организация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура КорСчетПриИзмененииНаСервере()

	КоличествоСубконто = Объект.КорСчет.ВидыСубконто.Количество();
	
	Если КоличествоСубконто > 0  Тогда
	
		Элементы.КорСубконто1.Доступность = Истина;
		Элементы.КорСубконто1.ВыбиратьТип = Ложь;
		Объект.КорСубконто1 = 
		Объект.КорСчет.ВидыСубконто.Получить(0).ВидСубконто.ТипЗначения.ПривестиЗначение(Объект.КорСубконто1);
		
	Иначе
	
		Элементы.КорСубконто1.Доступность = Ложь;
		Объект.КорСубконто1 = Неопределено;
		
	
	КонецЕсли;
	
	
	Если КоличествоСубконто > 1  Тогда
	
		Элементы.КорСубконто2.Доступность = Истина;
		Элементы.КорСубконто2.ВыбиратьТип = Ложь;
		Объект.КорСубконто2 = 
		Объект.КорСчет.ВидыСубконто.Получить(1).ВидСубконто.ТипЗначения.ПривестиЗначение(Объект.КорСубконто2);
		
		Массив = Новый Массив;
		
		Если ТипЗнч(Объект.КорСубконто2) = Тип("СправочникСсылка.ЗначенияПользовательскихСубконто") Тогда
		
			 Массив.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.КорСчет.ВидыСубконто.Получить(1).ВидСубконто));
		
		КонецЕсли;
		
		Элементы.КорСубконто2.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
		
		
	Иначе
	
		Элементы.КорСубконто2.Доступность = Ложь;
		Объект.КорСубконто2 = Неопределено;
		
	
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	
	КорСчетПриИзмененииНаСервере();
	
КонецПроцедуры
